Repository: matmo/rgedit-python3
Catalog: RCtrl/Translations/RCtrl/*/LC_MESSAGES/*.po
Languages: ro

source: your text goes here
ro: textul dvs apare aici

source: # Run misc stuff required by rgedit...
ro: # Execută diferite sarcini cerute de rgedit...

source: Error reading the messages and warnings file
ro: Erroare de citire a fişierului de mesaje şi avertismente

source: ############################ rgedit messages #################################
ro: ############################## mesaje rgedit ##################################

source: Unknown R tab!
ro: Pagină R necunoscută!

source: Change tab name
ro: Schimb

source: Always show tabs?
ro: Arată paginile mereu?

source: Show tabs on
ro: Arată paginile

source: top
ro: deasupra

source: left
ro: la stânga

source: right
ro: la dreapta

source: bottom
ro: jos

source: Close tab
ro: Închide pagina

source: Start R
ro: Porneşte R

source: Restart R
ro: Reporneşte R

source: Change R's working folder
ro: Schimbă directorul de lucru al R

source: Use document's folder
ro: Foloseşte directorul documentului

source: Save R workspace
ro: Salvează spaţiul de lucru R

source: Choose R's working folder
ro: Schimbă directorul de lucru al R

source: Cannot get current window
ro: Nu pot sa obţin fereastra curentă

source: Current document has not been saved: cannot change R's working folder to this...
ro: Documentul curent nu a fost salvat: nu pot schimba directorul de lucru al R la aşa ceva...

source: Open R Workspace
ro: Deschide spaţiu de lucru R

source: Save R Workspace
ro: Salvează spaţiu de lucru R

source: No R console open?
ro: Nici o consolă R nu e deschisă?

source: Run current line through R...
ro: Execută linia curentă prin R...

source: Run selection through R...
ro: Execută selecţia prin R...

source: Run whole file through R...
ro: Execută îintregul fişier prin R...

source: Run block 1 through R...
ro: Execută blocul 1 prin R...

source: Define block 1...
ro: Defineşte blocul 1...

source: Run block 2 through R...
ro: Execută blocul 2 prin R...

source: Define block 2...
ro: Defineşte blocul 2...

source: Create new R workspace tab...
ro: Crează o noua pagina de lucru în R...

source: Create new R workspace tab (max 3 tabs allowed)...
ro: Crează o noua pagina de lucru în R (maximum 3 sunt permise)...

source: Configure R interface
ro: Configurare interfaţă R

source: Check for updates
ro: Caută aduceri la zi

source: Insert Landmark Comment
ro: Inserează

source: Wizards
ro: Experţi

source: Show/hide toolbar
ro: Arată/ascunde bara de unelte

source: Attach/detach R Console
ro: Ataşează/detaşează consola R

source: Close R Console
ro: Închide consola R

source: Help
ro: Ajutor

source: About
ro: Despre

source: Show toolbar only for R files...
ro: Atară bara de unelte doar pentru fişiere R...

source: Run current selection through R...
ro: Execută selecţia curentă prin R...

source: About Rwizards...
ro: Despre Experţi...

source: Something fishy: cannot find the wizard with description "
ro: Ceva nu-i în regulă: nu pot găsi descrierea Expertului "

source: RWizards official package
ro: Pachetul ofocial RWizards (Experţi R)

source: A set of predefined Rwizards
ro: Un set de Experţi R pre-definit

source: Detached R console
ro: Consola R detaşată

source: R Console
ro: Consola R

source: Block 1 is not defined in the current document!
ro: Blocul 1 nu e definit in documentul curent!

source: You need a selection in order to define a block!
ro: Este nevoie de o selecţie pentru a defini un bloc!

source: Block 2 is not defined in the current document!
ro: Blocul 2 nu e definit in documentul curent!

source: Cannot read the latest available version from rgedit's website! Please, try again later...
ro: Nu pot citi ultima versiune disponibilă de pe site-ul rgedit! Vă rog sa reveniţi...

source: Cannot read the latest available version of the wizards package from rgedit's website! Please, try again later...
ro: Nu pot citi ultima versiune disponibilă de Experţi R de pe site-ul rgedit! Vă rog sa reveniţi...

source: ) and official wizards package (
ro: ) şi versiunea oficială de Experţi (

source: ) installed.
ro: ) instalate.

source: You have the latest version of rgedit (
ro: Aveţi ultima versiune de rgedit (

source: is available, and version
ro: e disponibilă, iar versiunea

source: is available. Would you like to download them?
ro: e disponibilă. Doriţi să la descărcaţi?

source: of rgedit installed, but the newer
ro: rgedit instată, dar mai recenta

source: You have version
ro: Aveţi versiunea

source: of the official wizards package installed, but the newer
ro: a pachetului oficial de Experţi, dar mai recenta

source: is available. Would you like to download it?
ro: a disponibilă. Doriţi să o descărcaţi?

source: Are you sure you want to completely close the R console? All open tabs will also be closed!
ro: Sunteţi sigur că doriţi să închideţi consola R complet? Toate paginile R deschise vor fi închise!

source: Black
ro: Negru

source: Blue
ro: Albastru

source: Cyan
ro: Verzui

source: Green
ro: Verde

source: Magenta
ro: Mov

source: None
ro: Nici una

source: Red
ro: Roşu

source: White
ro: Alb

source: Yellow
ro: Galben

source: Key shortcut for 'Run current line' is malformed!
ro: Combinaţia de taste pentru 'Execută linia curentă' este incorectă!

source: Key shortcut for 'Run selection' is malformed!
ro: Combinaţia de taste pentru 'Execută selecţia' este incorectă!

source: Key shortcut for 'Run whole file' is malformed!
ro: Combinaţia de taste pentru 'Execută întregul fişier' este incorectă!

source: Key shortcut for 'Run block 1' is malformed!
ro: Combinaţia de taste pentru 'Execută blocul 1' este incorectă!

source: Key shortcut for 'Define block 1' is malformed!
ro: Combinaţia de taste pentru 'Defineşte blocul 1' este incorectă!

source: Key shortcut for 'Run block 2' is malformed!
ro: Combinaţia de taste pentru 'Execută blocul 2' este incorectă!

source: Key shortcut for 'Define block 2' is malformed!
ro: Combinaţia de taste pentru 'Defineşte blocul 2' este incorectă!

source: Key shortcut for 'Create new R tab' is malformed!
ro: Combinaţia de taste pentru 'Crează o nouă pagină R' este incorectă!

source: Key shortcut for 'Configure R interface' is malformed!
ro: Combinaţia de taste pentru 'Configurează interfaţa R' este incorectă!

source: Key shortcut for 'Load R Workspace' is malformed!
ro: Combinaţia de taste pentru 'Încarcă spaţiul de lucru R' este incorectă!

source: Key shortcut for 'Save R Workspace' is malformed!
ro: Combinaţia de taste pentru 'Salvează spaţiul de lucru R' este incorectă!

source: Key shortcut for 'Attach/detach R console' is malformed!
ro: Combinaţia de taste pentru 'Ataşează/detaşează consola R' este incorectă!

source: Key shortcut for 'Close R console' is malformed!
ro: Combinaţia de taste pentru 'Închide consola R' este incorectă!

source: Key shortcuts have changed: please restart gedit for changed to become effective!
ro: Combinaţiile de taste au fost schimbate: vă rugăm să restartaţi gedit astfel încât schimbările să devină efective!

source: Make AutorunScriptPath relative
ro: Fă AutorunScriptPath relativă

source: The number of scrollback lines must be a positive integer!
ro: Numărul de linii reţinute trebuie sa fie un număr întreg pozitiv!

source: Please note that using COLORED PROMPTS has a side effect when browsing R's history (keys UP and DOWN). Please see the manual for details.
ro: Atenţie: utilizarea de PROMPT COLORAT are efecte nedorite asupra navigării prin istoria comezilor R (folosind tastele SUS şi JOS). Vă rugăm să consultaţi manualul pentru detalii.

source: Python directives must end with $]....
ro: Directivele Pyhton trebuie să se termine cu $]....

source: A variable must have a name!
ro: O variablă trebuie să aibă un nume!

source: A variable must have a description!
ro: O variablă trebuie să aibă o descriere!

source: A variable must have a type!
ro: O variablă trebuie să aibă un tip!

source: Variables of type "list" must have at least one value defined!
ro: Variabilele de tip "list" trebuie să aibă cel puţin o valoare definită!

source: Variables of type "editablelist" must have at least one value defined!
ro: Variabilele de tip "editablelist" trebuie să aibă cel puţin o valoare definită!

source: There must be at least one variable defined for each block!
ro: Cel puţin o variablă trebuie definită per bloc!

source: About the wizard...
ro: Despre Experţi...

source: Back
ro: Înapoi

source: Go to previous block...
ro: Îintoarce-te la blocul anterior...

source: Inspect code
ro: Inspectează codul

source: Inspect the generated R code...
ro: Inspectează codul R generat...

source: Run code!
ro: Execută codul!

source: I trust the wizard: go ahead and run the generated R code...
ro: Am încredere în acest Expert: execută direct codul R generat...

source: Next
ro: Următorul

source: Continue to next block...
ro: Continuă cu blocul următor...

source: Cancel
ro: Anulare

source: Cancel the wizard...
ro: Anulează Expertul...

source: " is undefined!
ro: " este nedefint!

source: Required variable "
ro: Variabila necesară "

source: Error: variable.GtkControl should have been defined!
ro: Erroare: variable.GtkControl ar fi trebuit definită!

source: Error opening & parsing wizard file "
ro: Eroare de deschidere şi citire a fişierului Expert "

source: Rgedit plugin cannot continue! Please fix the problem...
ro: Pluginul Rgedit nu poate continua! Vă rugăm să rezolvaţi problema...

source: Error: rwizard xml expected, and instead got "
ro: Eroare: xml rwizard era aşteptat, dar am găsit "

source: Error: rwizard must have a name!
ro: Eroare: rwizard trebuie sa aibă un nume!

source: Unknown value for the defaultbutton attribute :
ro: Valoare necunoscută pentru atributul defaultbutton :

source: There must at most one "about" node inside a "rwizard"
ro: Trebuie să existe cel mult un nod "about" în interiorul unui "rwizard"

source: There must at most one "help" node inside a "rwizard"
ro: Trebuie să existe cel mult un nod "help" în interiorul unui "rwizard"

source: There must a single "vars" node inside a "rwizard"
ro: Trebuie să existe un singur nod "vars" în interiorul unui "rwizard"

source: There must at most one "script" node inside a "rwizard"
ro: Trebuie să existe cel mult un nod "script" în interiorul unui "rwizard"

source: There must a single "template" node inside a "rwizard"
ro: Trebuie să existe un singur nod "template" în interiorul unui "rwizard"

source: Processing script...
ro: Script în curs de executare...

source: Unknown block-level user action
ro: Acţiune necunoscută la nivel de bloc

source: The resulting R code is empty...
ro: Codul R rezultat e gol...

source: Error opening userprefs.xml!
ro: Eroare de deschidere a fişierului userprefs.xml!

source: Error: rwizardsuserprefs xml expected, and instead got "
ro: Eroare: xml rwizardsuserprefs era aşteptat, dar a fost găsit "

source: There must a single "prefs" node inside a "rwizardsuserprefs"
ro: Trebuie să existe un singur nod "prefs" în interiorul unui "rwizard"

source: R structure
ro: Structura R

source: Enable?
ro: Activat?

source: Enable or disable the info concerning the structure of the R file...
ro: Activează sau dezactivează informaţiile privind structura fişierului R...

source: Force refresh of info concerning the structure of the R file...
ro: Activează forţat informaţiile privind structura fişierului R...

source: " is illegal!
ro: " este incorect!

source: The line number "
ro: Numărul de linie "

source: The line number must be a positive integer smaller than the number of lines in the document!
ro: Numărul de linie trebuie să fie un număr întreg pozitiv mai mic decât numărul de linii din document!
